update readme with Mermaid
